lovyan03/LovyanGFX/src/lgfx/v1/platforms/rp2040/common.cpp
/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)

Porting for RP2040:
 [yasuhirok](https://github.com/yasuhirok-git)
/----------------------------------------------------------------------------*/
#if defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040) || defined(USE_PICO_SDK)

#include "common.hpp"
#include <array>
#include <unordered_map>

#include <hardware/structs/resets.h>
#include <hardware/structs/padsbank0.h>
#include <hardware/structs/sio.h>
#include <hardware/structs/iobank0.h>
#include <hardware/sync.h>
#include <hardware/resets.h>
#include <hardware/clocks.h>
#include <hardware/gpio.h>
#include <hardware/spi.h>
#include <hardware/i2c.h>


#if PICO_SDK_VERSION_MAJOR<2
  // NOTE: old pico sdk (before rp2350) used enum type for gpio function, iobank was named differently too
  #define gpio_function_t enum gpio_function
  #define io_bank0_hw_t iobank0_hw_t
#endif

// #define DEBUG

#if defined(DEBUG)
#include <DebugUtil.hpp>
#else
#define DBGPRINT(fmt, ...)
#define DBG_ENTER()
#define DBGPRINTFUNC(fmt, ...)
#define put_dump_byte(data, addr, length)
#endif

// 参考:
// https://os.mbed.com/docs/mbed-os/v6.15/mbed-os-api-doxy/group__hal__gpio.html
// https://github.com/arduino/ArduinoCore-mbed/releases
// https://github.com/raspberrypi/pico-sdk

namespace lgfx
{
 inline namespace v1
 {
  namespace rp2040
  {
    static bool pin_check(int pin, const uint8_t *pinlist)
    {
      int idx = 0;
      while (pinlist[idx] != static_cast<int>(UINT8_MAX))
      {
        if (static_cast<int>(pinlist[idx]) == pin)
        {
          return true;
        }
        idx++;
      }
      return false;
    }
  }

  namespace {

    bool lgfx_gpio_set_function(int_fast16_t pin, gpio_function_t fn)
    {
      if (pin < 0 || pin >= static_cast<int_fast16_t>(NUM_BANK0_GPIOS))
      {
        return false;
      }
      if ((((uint32_t)fn << IO_BANK0_GPIO0_CTRL_FUNCSEL_LSB) & ~IO_BANK0_GPIO0_CTRL_FUNCSEL_BITS) != 0)
      {
        return false;
      }
      uint32_t temp = padsbank0_hw->io[pin];
      temp &= ~(PADS_BANK0_GPIO0_IE_BITS | PADS_BANK0_GPIO0_OD_BITS);
      temp |= PADS_BANK0_GPIO0_IE_BITS;
      padsbank0_hw->io[pin] = temp;
      volatile io_bank0_hw_t *iobank0_regs = reinterpret_cast<volatile io_bank0_hw_t *>(IO_BANK0_BASE);
      iobank0_regs->io[pin].ctrl = fn << IO_BANK0_GPIO0_CTRL_FUNCSEL_LSB;
      #if defined(PICO_RP2350)
        // Remove pad isolation now that the correct peripheral is in control of the pad
        hw_clear_bits(&padsbank0_hw->io[pin], PADS_BANK0_GPIO0_ISO_BITS);
      #endif
      return true;
    }

    bool lgfx_gpio_init(int_fast16_t pin)
    {
      if (pin < 0 || pin >= static_cast<int_fast16_t>(NUM_BANK0_GPIOS))
      {
        return false;
      }
      return lgfx_gpio_set_function(pin, GPIO_FUNC_SIO);
    }

    __attribute__ ((always_inline)) inline void lgfx_gpio_set_pulls(int_fast16_t pin, bool up, bool down)
    {
      uint32_t temp = padsbank0_hw->io[pin];
      temp &= ~(PADS_BANK0_GPIO0_PUE_BITS | PADS_BANK0_GPIO0_PDE_BITS);
      temp |= (((up ? 1U : 0U) << PADS_BANK0_GPIO0_PUE_LSB) | ((down ? 1U : 0U) << PADS_BANK0_GPIO0_PDE_LSB));
    }

    __attribute__ ((always_inline)) inline void lgfx_gpio_pull_up(int_fast16_t pin)
    {
      lgfx_gpio_set_pulls(pin, true, false);
    }

    __attribute__ ((always_inline)) inline void lgfx_gpio_pull_down(int_fast16_t pin)
    {
      lgfx_gpio_set_pulls(pin, false, true);
    }

    __attribute__ ((always_inline)) inline void lgfx_gpio_disable_pulls(int_fast16_t pin)
    {
      lgfx_gpio_set_pulls(pin, false, false);
    }

    bool lgfx_gpio_mode(int_fast16_t pin, pin_mode_t mode)
    {
      if (pin < 0 || pin >= static_cast<int_fast16_t>(NUM_BANK0_GPIOS))
      {
        return false;
      }
      bool rc = false;
      switch (mode)
      {
      case pin_mode_t::output:
        [[fallthrough]];
      case pin_mode_t::input:
        lgfx_gpio_disable_pulls(pin);
        rc = true;
        break;
      case pin_mode_t::input_pullup:
        lgfx_gpio_pull_up(pin);
        rc = true;
        break;
      case pin_mode_t::input_pulldown:
        lgfx_gpio_pull_down(pin);
        rc = true;
        break;
      default:
        break;
      }
      return rc;
    }

    bool lgfx_gpio_set_dir(int_fast16_t pin, bool out)
    {
      if (pin < 0 || pin >= static_cast<int_fast16_t>(NUM_BANK0_GPIOS))
      {
        return false;
      }
      const uint32_t mask = 1UL << pin;
      if (out)
      {
        sio_hw->gpio_oe_set = mask;
      }
      else
      {
        sio_hw->gpio_oe_clr = mask;
      }
      return true;
    }

    __attribute__ ((always_inline)) inline void lgfx_reset_block(uint32_t bits)
    {
      reset_block(bits);
    }

    __attribute__((always_inline)) inline void lgfx_unreset_block_wait(uint32_t bits)
    {
      unreset_block_wait(bits);
    }
  }

  void pinMode(int_fast16_t pin, pin_mode_t mode)
  {
    if (pin < 0 || pin >= static_cast<int_fast16_t>(NUM_BANK0_GPIOS))
    {
      return;
    }
    lgfx_gpio_init(pin);
    lgfx_gpio_mode(pin, mode);
    lgfx_gpio_set_dir(pin, mode == pin_mode_t::output);
  }

//----------------------------------------------------------------------------

  namespace spi
  {
    namespace
    {
      struct spi_info_str {
        uint32_t ref_count { 0 };
        int pin_sclk { -1 };
        int pin_miso { -1 };
        int pin_mosi { -1 };
      };

      volatile spi_hw_t * const spi_dev[] = {
        reinterpret_cast<volatile spi_hw_t *>(SPI0_BASE),
        reinterpret_cast<volatile spi_hw_t *>(SPI1_BASE),
      };
      constexpr int n_spi = std::extent<decltype(spi_dev), 0>::value;

#if defined(PICO_RP2350)
      // RP2350 Dataheetの 9.4. Function Select (Table 642)を参照
      // ※30以降は2350Bで使用可能
      constexpr uint8_t spi0_sclk_pinlist[] = {  2,  6, 18, 22, 34, 38,     UINT8_MAX };
      constexpr uint8_t spi0_miso_pinlist[] = {  0,  4, 16, 20, 32, 36,     UINT8_MAX };
      constexpr uint8_t spi0_mosi_pinlist[] = {  3,  7, 19, 23, 35, 39,     UINT8_MAX };
      constexpr uint8_t spi1_sclk_pinlist[] = { 10, 14, 26,     30, 42, 46, UINT8_MAX };
      constexpr uint8_t spi1_miso_pinlist[] = {  8, 12, 24, 28, 40, 44,     UINT8_MAX };
      constexpr uint8_t spi1_mosi_pinlist[] = { 11, 15, 27,     31, 43, 47, UINT8_MAX };
#else
      // RP2040 Dataheetの 1.4.3. GPIO Functions Table 2を参照
      constexpr uint8_t spi0_sclk_pinlist[] = {  2,  6, 18, 22, UINT8_MAX };
      constexpr uint8_t spi0_miso_pinlist[] = {  0,  4, 16, 20, UINT8_MAX };
      constexpr uint8_t spi0_mosi_pinlist[] = {  3,  7, 19, 23, UINT8_MAX };
      constexpr uint8_t spi1_sclk_pinlist[] = { 10, 14, 26,     UINT8_MAX };
      constexpr uint8_t spi1_miso_pinlist[] = {  8, 12, 24, 28, UINT8_MAX };
      constexpr uint8_t spi1_mosi_pinlist[] = { 11, 15, 27,     UINT8_MAX };
#endif

      constexpr uint32_t PRESCALE_ERROR = UINT32_MAX;

      //
      constexpr struct spi_pinlist_str {
        const uint8_t *sclk_pinlist;
        const uint8_t *miso_pinlist;
        const uint8_t *mosi_pinlist;
      } spi_pinlist[] = {
        {
          .sclk_pinlist = spi0_sclk_pinlist,
          .miso_pinlist = spi0_miso_pinlist,
          .mosi_pinlist = spi0_mosi_pinlist,
        },
        {
          .sclk_pinlist = spi1_sclk_pinlist,
          .miso_pinlist = spi1_miso_pinlist,
          .mosi_pinlist = spi1_mosi_pinlist,
        },
      };

      spi_info_str spi_info[n_spi];
    }

//----------------------------------------------------------------------------

    uint32_t FreqToClockDiv(uint32_t hz)
    {
      uint32_t fapb = clock_get_hz(clk_peri) >> 1;
      if (fapb <= hz) return 0;
      uint32_t div_num = fapb / (1 + hz);
      if (div_num > 255) div_num = 255;
      return div_num;
    }
    namespace
    {

      __attribute__ ((always_inline)) inline void lgfx_spi_reset(volatile spi_hw_t * spi_regs)
      {
        lgfx_reset_block((spi_regs == spi_dev[0]) ? RESETS_RESET_SPI0_BITS : RESETS_RESET_SPI1_BITS);
      }

      __attribute__ ((always_inline)) inline void lgfx_spi_unreset(volatile spi_hw_t * spi_regs)
      {
        lgfx_unreset_block_wait((spi_regs == spi_dev[0]) ? RESETS_RESET_SPI0_BITS : RESETS_RESET_SPI1_BITS);
      }

      static uint32_t last_clock_div = 1;

      bool lgfx_spi_set_baudrate(volatile spi_hw_t * spi_regs, uint32_t baudrate)
      {
        spi_regs->cpsr = 2;  // prescale
        last_clock_div = FreqToClockDiv(baudrate);

        uint32_t temp = spi_regs->cr0;
        temp &= ~SPI_SSPCR0_SCR_BITS;
        temp |= (last_clock_div << SPI_SSPCR0_SCR_LSB);
        spi_regs->cr0 = temp;
        return true;
      }

