lovyan03/LovyanGFX/src/lgfx/v1/platforms/rp2040/common.cpp
      __attribute__ ((always_inline)) inline void lgfx_spi_set_format(volatile spi_hw_t * spi_regs, uint data_bits, spi_cpol_t cpol, spi_cpha_t cpha, [[maybe_unused]]spi_order_t order)
      {
        uint32_t temp = spi_regs->cr0;
        temp &= ~(SPI_SSPCR0_DSS_BITS | SPI_SSPCR0_SPO_BITS | SPI_SSPCR0_SPH_BITS);
        temp |= (data_bits - 1) << SPI_SSPCR0_DSS_LSB |
          cpol << SPI_SSPCR0_SPO_LSB |
          cpha << SPI_SSPCR0_SPH_LSB;
        spi_regs->cr0 = temp;
      }

      bool lgfx_spi_set_pin_function(int mosi, int miso, int sclk)
      {
        if ((mosi != -1) && (!lgfx_gpio_set_function(mosi, GPIO_FUNC_SPI))) { return false; }
        if ((sclk != -1) && (!lgfx_gpio_set_function(sclk, GPIO_FUNC_SPI))) { return false; }
        if ((miso != -1) && (!lgfx_gpio_set_function(miso, GPIO_FUNC_SPI))) { return false; }
        return true;
      }

      bool lgfx_spi_init(volatile spi_hw_t * spi_regs)
      {
        lgfx_spi_reset(spi_regs);
        lgfx_spi_unreset(spi_regs);
        // SPIのクロック周波数を設定
        if (!lgfx_spi_set_baudrate(spi_regs, 1000000))
        {
          return false;
        }
        lgfx_spi_set_format(spi_regs, 8, SPI_CPOL_0, SPI_CPHA_0, SPI_MSB_FIRST);

        spi_regs->dmacr |= (SPI_SSPDMACR_TXDMAE_BITS | SPI_SSPDMACR_RXDMAE_BITS);
        // SPI有効化
        spi_regs->cr1 |= SPI_SSPCR1_SSE_BITS;
        DBGPRINT("cr1 %08x\n", spi_regs->cr1);
        return true;
      }

      void lgfx_spi_deinit(volatile spi_hw_t * spi_regs)
      {
        spi_regs->cr1 &= ~SPI_SSPCR1_SSE_BITS;
        spi_regs->dmacr &= ~(SPI_SSPDMACR_TXDMAE_BITS | SPI_SSPDMACR_RXDMAE_BITS);
        lgfx_spi_reset(spi_regs);
      }
    }

    static std::pair<cpp::result<void, error_t>, bool> check_pin_update(int current_pin, int new_pin)
    {
      bool need_update = false;
      cpp::result<void, error_t> result = {};
      if (new_pin != -1)
      {
        if (current_pin == -1)
        {
          need_update = true;
        }
        else if (current_pin != new_pin)
        {
          result = cpp::fail(error_t::invalid_arg);
        }
      }
      return { result, need_update };
    }

//----------------------------------------------------------------------------

    cpp::result<void, error_t> init(int spi_port, int pin_sclk, int pin_miso, int pin_mosi)
    {
      DBGPRINT("enter %s\n", __func__);
      if (spi_port < 0 || spi_port >= n_spi)
      {
        return cpp::fail(error_t::invalid_arg);
      }
      // DBGPRINT("ref_count %d\n", spi_info[spi_port].ref_count);
      if (spi_info[spi_port].ref_count == 0)
      {
        const spi_pinlist_str pinlist = spi_pinlist[spi_port];
        if (!lgfx::v1::rp2040::pin_check(pin_sclk, pinlist.sclk_pinlist))
        {
          return cpp::fail(error_t::invalid_arg);
        }
        // pin_misoは未使用(-1)でもOKとする
        if (pin_miso != -1 && !lgfx::v1::rp2040::pin_check(pin_miso, pinlist.miso_pinlist))
        {
          return cpp::fail(error_t::invalid_arg);
        }
        // pin_mosiは未使用(-1)でもOKとする
        if (pin_mosi != -1 && !lgfx::v1::rp2040::pin_check(pin_mosi, pinlist.mosi_pinlist))
        {
          return cpp::fail(error_t::invalid_arg);
        }
        lgfx_spi_set_pin_function(pin_mosi, pin_miso, pin_sclk);
        spi_info[spi_port].pin_sclk = pin_sclk;
        spi_info[spi_port].pin_miso = pin_miso;
        spi_info[spi_port].pin_mosi = pin_mosi;
        if (!lgfx_spi_init(spi_dev[spi_port]))
        {
          return cpp::fail(error_t::invalid_arg);
        }
        spi_info[spi_port].ref_count = 1;
        DBGPRINT("return %s\n", __func__);
        return {};
      }
      //
      if (spi_info[spi_port].pin_sclk != pin_sclk)
      {
        return cpp::fail(error_t::invalid_arg);
      }
      //
      auto rc = check_pin_update(spi_info[spi_port].pin_miso, pin_miso);
      auto result_miso = rc.first;
      auto need_update_miso = rc.second;
      if (result_miso.has_error())
      {
        return result_miso;
      }
      if (need_update_miso)
      {
        spi_info[spi_port].pin_miso = pin_miso;
      }
      //
      rc = check_pin_update(spi_info[spi_port].pin_mosi, pin_mosi);
      auto result_mosi = rc.first;
      auto need_update_mosi = rc.second;
      if (result_mosi.has_error())
      {
        return result_mosi;
      }
      if (need_update_mosi)
      {
        spi_info[spi_port].pin_mosi = pin_mosi;
      }
      if (need_update_miso || need_update_mosi)
      {
        lgfx_spi_set_pin_function(spi_info[spi_port].pin_mosi,
          spi_info[spi_port].pin_miso, spi_info[spi_port].pin_sclk);
      }
      spi_info[spi_port].ref_count++;
      DBGPRINT("return %s\n", __func__);
      return {};
    }

    void release(int spi_port)
    {
      if (spi_info[spi_port].ref_count == 0)
      {
        return;
      }
      spi_info[spi_port].ref_count--;
      if (spi_info[spi_port].ref_count == 0)
      {
        spi_info[spi_port].pin_sclk = -1;
        spi_info[spi_port].pin_miso = -1;
        spi_info[spi_port].pin_mosi = -1;
        lgfx_spi_deinit(spi_dev[spi_port]);
      }
    }

    bool lgfx_spi_set_frequency(int spi_port, uint32_t baudrate)
    {
      return lgfx_spi_set_baudrate(spi_dev[spi_port], baudrate);
    }


    void beginTransaction(int spi_port, uint32_t freq, int spi_mode)
    {
      static constexpr spi_cpha_t cpha_table[] = { SPI_CPHA_0, SPI_CPHA_1, SPI_CPHA_0, SPI_CPHA_1 };
      static constexpr spi_cpol_t cpol_table[] = { SPI_CPOL_0, SPI_CPOL_0, SPI_CPOL_1, SPI_CPOL_1 };
      if (spi_mode < 0 || spi_mode > 3)
      {
        spi_mode = 0;
      }
      lgfx_spi_set_format(spi_dev[spi_port], 8, cpol_table[spi_mode], cpha_table[spi_mode], SPI_MSB_FIRST);
      lgfx_spi_set_baudrate(spi_dev[spi_port], freq);
    }

    void endTransaction([[maybe_unused]]int spi_port)
    {

    }


    bool is_rx_fifo_not_empty(int spi_port)
    {
      return ((spi_dev[spi_port]->sr & SPI_SSPSR_RNE_BITS)  != 0);
    }

    bool is_tx_fifo_not_full(int spi_port)
    {
      return ((spi_dev[spi_port]->sr & SPI_SSPSR_TNF_BITS)  != 0);
    }

    void clear_rx_fifo(int spi_port)
    {
      // FIFO内のデータをすべて読みだす
      while (is_rx_fifo_not_empty(spi_port))
      {
        static_cast<void>(spi_dev[spi_port]->dr);
      }
    }

    // FIFOを8bitモードにする。
    void set_dss_8(int spi_port)
    {
      //spi_dev[spi_port]-> cr0 BIt7 mask This was the correct way to set it to 16bit to 8-bit mode. 16bit to 8Bitモードへの設定方法です
      //Spi_stk = spi_dev[spi_port]->cr0;
      uint32_t _sspcr0_mask_8bit = spi_dev[spi_port]-> cr0;
      _sspcr0_mask_8bit &= ~0x0000000f;
      _sspcr0_mask_8bit |=  0x0000007;
      spi_dev[spi_port]->cr0 = _sspcr0_mask_8bit;
    }


