lovyan03/LovyanGFX/src/lgfx/v1/platforms/rp2040/common.cpp
    void readBytes(int spi_port, uint8_t* dst, size_t length)
    {
      uint8_t *p;
      p = dst;
      clear_rx_fifo (spi_port);
      set_dss_8 (spi_port);
      auto tx_length = length;
      do
      {
        DBGPRINT("tx_length %d : length %d\n", tx_length, length);
        while (tx_length && is_tx_fifo_not_full(spi_port))
        {
          // データを送信（中身は何でもよい訳ではない！ Send data (not just anything goes！）
          //Touch_XPT2046.cppで設定された制御コードをSPIの送信データに乗せないと、XPT2046は動作しません
          //If the control code set in Touch_XPT2046.cpp is not included in the SPI transmission data, the XPT2046 will not work.
          spi_dev[spi_port]->dr = *p++; //!!
          --tx_length;
        }
        // 制御コードが記載された *dst を上書きしないよう比較保護して受信バッファと兼用する
        // *dst, which contains the control code, is protected from being overwritten and is used as a receive buffer.
        while ((length > tx_length) && is_tx_fifo_not_full (spi_port))
        {
          *dst++ = spi_dev[spi_port]->dr;
          --length;
        }
      } while (length);
    }
  }

//----------------------------------------------------------------------------

  namespace i2c
  {
    namespace
    {
      // constant
      constexpr uint32_t i2c_timeout = 10;
      constexpr uint64_t i2c_1Hz_period_ns{1000ULL * 1000ULL * 1000ULL};

      enum class restart_state_t {
        none,
        restart,
      };
      enum class stop_state_t {
        none,
        stop,
      };
      enum class need_wait_t {
        none,
        wait,
      };

      struct i2c_info_str {
        uint32_t ref_count{0};
        int pin_sda{-1};
        int pin_scl{-1};
        uint32_t timeout_count; // 送受信時のタイムアウト検出用
        uint8_t last_byte;    // 未送信のデータ
        bool last_byte_valid{ false }; // 未送信のデータが有効ならfalse
        restart_state_t restart{ restart_state_t::none };
      };

      volatile i2c_hw_t *const i2c_dev[] = {
        reinterpret_cast<volatile i2c_hw_t *>(I2C0_BASE),
        reinterpret_cast<volatile i2c_hw_t *>(I2C1_BASE),
      };
      constexpr int n_i2c = std::extent<decltype(i2c_dev), 0>::value;

#if defined(PICO_RP2350)
      // RP2350 Dataheetの 9.4. Function Select (Table 642)を参照
      // ※30以降は2350Bで使用可能
      constexpr uint8_t i2c0_sda_pinlist[] = {  0,  4,  8, 12, 16, 20, 24, 28,     32, 36, 40, 44, UINT8_MAX };
      constexpr uint8_t i2c0_sck_pinlist[] = {  1,  5,  9, 13, 17, 21, 25, 29,     33, 37, 41, 45, UINT8_MAX };
      constexpr uint8_t i2c1_sda_pinlist[] = {  2,  6, 10, 14, 18, 22, 26,     30, 34, 38, 42, 46, UINT8_MAX };
      constexpr uint8_t i2c1_sck_pinlist[] = {  3,  7, 11, 15, 19, 23, 27,     31, 35, 39, 43, 47, UINT8_MAX };
#else
      // RP2040 Dataheetの 1.4.3. GPIO Functions Table 2を参照
      constexpr uint8_t i2c0_sda_pinlist[] = {  0,  4,  8, 12, 16, 20, 24, 28, UINT8_MAX };
      constexpr uint8_t i2c0_sck_pinlist[] = {  1,  5,  9, 13, 17, 21, 25, 29, UINT8_MAX };
      constexpr uint8_t i2c1_sda_pinlist[] = {  2,  6, 10, 14, 18, 22, 26,     UINT8_MAX };
      constexpr uint8_t i2c1_sck_pinlist[] = {  3,  7, 11, 15, 19, 23, 27,     UINT8_MAX };
#endif

      constexpr struct i2c_pinlist_str {
        const uint8_t *sda_pinlist;
        const uint8_t *scl_pinlist;
      } i2c_pinlist[] = {
        {
          .sda_pinlist = i2c0_sda_pinlist,
          .scl_pinlist = i2c0_sck_pinlist,
        },
        {
          .sda_pinlist = i2c1_sda_pinlist,
          .scl_pinlist = i2c1_sck_pinlist,
        },
      };

      i2c_info_str i2c_info[n_i2c];
      std::unordered_map<uint32_t, std::array<uint32_t, 4>> prescale_map;

      __attribute__((always_inline)) inline void lgfx_i2c_reset(volatile i2c_hw_t *i2c_regs)
      {
        lgfx_reset_block(i2c_regs == i2c_dev[0] ? RESETS_RESET_I2C0_BITS : RESETS_RESET_I2C1_BITS);
      }

      __attribute__((always_inline)) inline void lgfx_i2c_unreset(volatile i2c_hw_t *i2c_regs)
      {
        lgfx_unreset_block_wait(i2c_regs == i2c_dev[0] ? RESETS_RESET_I2C0_BITS : RESETS_RESET_I2C1_BITS);
      }

      __attribute__((always_inline)) inline void lgfx_i2c_enable(volatile i2c_hw_t *i2c_regs)
      {
        i2c_regs->enable = I2C_IC_ENABLE_ENABLE_VALUE_ENABLED;
      }

      __attribute__((always_inline)) inline void lgfx_i2c_disable(volatile i2c_hw_t *i2c_regs)
      {
        i2c_regs->enable = I2C_IC_ENABLE_ENABLE_VALUE_DISABLED;
      }

      __attribute__((always_inline)) inline void set_target_address(volatile i2c_hw_t *const i2c_regs, int addr)
      {
        lgfx_i2c_disable(i2c_regs);
        i2c_regs->tar = addr & I2C_IC_TAR_IC_TAR_BITS;
        lgfx_i2c_enable(i2c_regs);
      }

      __attribute__((always_inline)) inline void send_data(volatile i2c_hw_t *const i2c_regs, uint8_t data, restart_state_t restart, stop_state_t stop)
      {
        i2c_regs->data_cmd = ((restart == restart_state_t::restart) ? I2C_IC_DATA_CMD_RESTART_BITS : 0x0) |
                             ((stop == stop_state_t::stop) ? I2C_IC_DATA_CMD_STOP_BITS : 0x0) |
                             static_cast<uint32_t>(data);
      }

      __attribute__((always_inline)) inline void prepare_recv(volatile i2c_hw_t *const i2c_regs, bool restart, bool stop)
      {
        i2c_regs->data_cmd = (restart ? I2C_IC_DATA_CMD_RESTART_BITS : 0x0) |
                              (stop ? I2C_IC_DATA_CMD_STOP_BITS : 0x0) |
                              I2C_IC_DATA_CMD_CMD_BITS | 0xaa;
      }

      __attribute__((always_inline)) inline uint8_t recv_data(volatile i2c_hw_t *const i2c_regs)
      {
        return static_cast<uint8_t>(i2c_regs->data_cmd);
      }

      __attribute__((always_inline)) inline bool is_rx_fifo_not_empty(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_RFNE_BITS) != 0);
      }

      __attribute__((always_inline)) inline bool is_rx_fifo_empty(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_RFNE_BITS) == 0);
      }

      __attribute__((always_inline)) inline bool is_tx_fifo_full(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_TFNF_BITS) == 0);
      }

