lovyan03/LovyanGFX/src/lgfx/v1/platforms/rp2040/common.cpp
      __attribute__((always_inline)) inline bool is_tx_fifo_not_full(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_TFNF_BITS) != 0);
      }

      __attribute__((always_inline)) inline bool is_tx_fifo_empty(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_TFE_BITS) != 0);
      }

      static __attribute__((always_inline)) inline bool is_tx_fifo_not_empty(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->status & I2C_IC_STATUS_TFE_BITS) == 0);
      }
      __attribute__((always_inline)) inline bool is_tx_not_complete(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->raw_intr_stat & I2C_IC_RAW_INTR_STAT_TX_EMPTY_BITS) == 0);
      }

      __attribute__((always_inline)) inline void abort_transfer(volatile i2c_hw_t *const i2c_regs)
      {
        i2c_regs->enable = I2C_IC_ENABLE_ENABLE_BITS | I2C_IC_ENABLE_ABORT_BITS;
      }

      __attribute__((always_inline)) inline bool is_abort_complete(volatile i2c_hw_t *const i2c_regs)
      {
        return ((i2c_regs->enable & I2C_IC_ENABLE_ABORT_BITS) == 0);
      }

      __attribute__((always_inline)) inline uint32_t get_tx_fifo_cnt(volatile i2c_hw_t *const i2c_regs) {
          return i2c_regs->txflr;
      }

      __attribute__((always_inline)) inline uint32_t get_write_available(volatile i2c_hw_t *const i2c_regs) {
        static constexpr  uint32_t IC_TX_BUFFER_DEPTH = 16;
        return IC_TX_BUFFER_DEPTH - get_tx_fifo_cnt(i2c_regs);
      }

      __attribute__((always_inline)) inline uint32_t get_read_available(volatile i2c_hw_t *const i2c_regs) {
        return i2c_regs->rxflr;
      }

      __attribute__((always_inline)) inline bool wait_for_txfifo_not_full(int i2c_port)
      {
        volatile i2c_hw_t *const i2c_regs = i2c_dev[i2c_port];
        bool rc = true;
        uint32_t wait_count = i2c_info[i2c_port].timeout_count;
        uint32_t i = 0;
        while (is_tx_fifo_full(i2c_regs)) {
          i++;
          if (i > wait_count) {
            rc = false;
            break;
          }
        }
        return rc;
      }

      __attribute__((always_inline)) inline bool wait_for_txfifo_empty(int i2c_port)
      {
        volatile i2c_hw_t *const i2c_regs = i2c_dev[i2c_port];
        bool rc = true;
        uint32_t wait_count = i2c_info[i2c_port].timeout_count * (get_tx_fifo_cnt(i2c_regs) + 1);
        uint32_t i = 0;
        while (is_tx_not_complete(i2c_regs)) {
          i++;
          if (i > wait_count) {
            rc = false;
            break;
          }
        }
        return rc;
      }

      __attribute__((always_inline)) inline bool wait_for_tx_complete(int i2c_port)
      {
        volatile i2c_hw_t *const i2c_regs = i2c_dev[i2c_port];
        bool rc = true;
        uint32_t wait_count = i2c_info[i2c_port].timeout_count * (get_tx_fifo_cnt(i2c_regs) + 1);
        uint32_t i = 0;
        while (is_tx_fifo_not_empty(i2c_regs)) { // TODO:
          i++;
          if (i > wait_count) {
            rc = false;
            break;
          }
        }
        return rc;
      }

      __attribute__((always_inline)) inline bool wait_for_rxfifo_not_empty(int i2c_port)
      {
        volatile i2c_hw_t *const i2c_regs = i2c_dev[i2c_port];
        bool rc = true;
        uint32_t wait_count = i2c_info[i2c_port].timeout_count;
        uint32_t i = 0;
        while (is_rx_fifo_empty(i2c_regs)) {
          i++;
          if (i > wait_count) {
            rc = false;
            DBGPRINT("i = %d\n", i);
            break;
          }
        }
        return rc;
      }

      __attribute__((always_inline)) inline void set_last_byte(int i2c_port, uint8_t last_byte)
      {
        auto info = &i2c_info[i2c_port];
        info->last_byte = last_byte;
        info->last_byte_valid = true;
      }

      bool send_byte_blocking(int i2c_port, uint8_t byte, stop_state_t stop)
      {
        volatile i2c_hw_t *const i2c_regs = i2c_dev[i2c_port];
        auto info = &i2c_info[i2c_port];
        bool rc = wait_for_txfifo_not_full(i2c_port);
        if (!rc) {
          return false;
        }
        send_data(i2c_regs, byte, info->restart, stop);
        return true;
      }

      bool send_last_byte(int i2c_port, stop_state_t stop, need_wait_t need_wait)
      {
        auto info = &i2c_info[i2c_port];
        if (!info->last_byte_valid) {
          return true;
        }
        bool rc = send_byte_blocking(i2c_port, info->last_byte, stop);
        if (!rc) {
          DBGPRINT("send_byte_blocking() failed\n");
          return false;
        }
        info->last_byte_valid = false;
        if (need_wait == need_wait_t::none) {
          return true;
          }
        rc = wait_for_tx_complete(i2c_port);
        return rc;
      }

      constexpr uint32_t calc_scl_factor(uint32_t period, uint32_t scl_low, uint32_t scl_high)
      {
        return ((period + scl_low - scl_high) / 2);
      }

      constexpr uint32_t nstoclk(uint32_t time_ns, uint32_t clk_freq)
      {
        if (time_ns == 0)
        {
          return 0;
        }
        constexpr uint32_t MHz{1000 * 1000};
        uint32_t clk_freq_MHz = (clk_freq + MHz - 1) / MHz;
        return (((time_ns * clk_freq_MHz) + 1000 - 1) / 1000);
      }

      bool lgfx_i2c_set_baudrate(volatile i2c_hw_t *i2c_regs, uint32_t baudrate)
        {
          uint32_t hcnt;
          uint32_t lcnt;
          uint32_t sda_tx_setup_count;
          uint32_t sda_tx_hold_count;
          enum
          {
            i2c_standard_mode = 0,
            i2c_fast_mode = 1,
            i2c_fast_mode_plus = 2
          } i2c_speed;

          static constexpr uint32_t i2c_standard_mode_freq{100 * 1000};
          static constexpr uint32_t i2c_standard_mode_min_scl_high_time_ns{4000};
          static constexpr uint32_t i2c_standard_mode_min_scl_low_time_ns{4700};
          static constexpr uint32_t i2c_standard_mode_min_data_setup_time_ns{250};
          static constexpr uint32_t i2c_standard_mode_min_data_hold_time_ns{300};
          static constexpr uint32_t i2c_standard_mode_period_ns{i2c_1Hz_period_ns / (static_cast<uint64_t>(i2c_standard_mode_freq))};

          static constexpr uint32_t i2c_fast_mode_freq{400 * 1000};
          static constexpr uint32_t i2c_fast_mode_min_scl_high_time_ns{600};
          static constexpr uint32_t i2c_fast_mode_min_scl_low_time_ns{1300};
          static constexpr uint32_t i2c_fast_mode_min_data_setup_time_ns{100};
          static constexpr uint32_t i2c_fast_mode_min_data_hold_time_ns{300};
          static constexpr uint32_t i2c_fast_mode_period_ns{i2c_1Hz_period_ns / (static_cast<uint64_t>(i2c_fast_mode_freq))};

          static constexpr uint32_t i2c_fast_mode_plus_freq{1000 * 1000};
          static constexpr uint32_t i2c_fast_mode_plus_min_scl_high_time_ns{260};
          static constexpr uint32_t i2c_fast_mode_plus_min_scl_low_time_ns{500};
          static constexpr uint32_t i2c_fast_plus_mode_min_data_setup_time_ns{50};
          static constexpr uint32_t i2c_fast_mode_plus_min_data_hold_time_ns{0};
          static constexpr uint32_t i2c_fast_mode_plus_period_ns{i2c_1Hz_period_ns / (static_cast<uint64_t>(i2c_fast_mode_plus_freq))};

          static constexpr uint32_t i2c_scl_factor_table[] = {
              calc_scl_factor(i2c_standard_mode_period_ns, i2c_standard_mode_min_scl_low_time_ns, i2c_standard_mode_min_scl_high_time_ns),
              calc_scl_factor(i2c_fast_mode_period_ns, i2c_fast_mode_min_scl_low_time_ns, i2c_fast_mode_min_scl_high_time_ns),
              calc_scl_factor(i2c_fast_mode_plus_period_ns, i2c_fast_mode_plus_min_scl_low_time_ns, i2c_fast_mode_plus_min_scl_high_time_ns),
          };
          static constexpr uint32_t i2c_period_table[] = {
              i2c_standard_mode_period_ns,
              i2c_fast_mode_period_ns,
              i2c_fast_mode_plus_period_ns,
          };
          static constexpr uint32_t i2c_data_setup_time_table[] = {
              i2c_standard_mode_min_data_setup_time_ns,
              i2c_fast_mode_min_data_setup_time_ns,
              i2c_fast_plus_mode_min_data_setup_time_ns,
          };
          static constexpr uint32_t i2c_data_hold_time_table[] = {
              i2c_standard_mode_min_data_hold_time_ns,
              i2c_fast_mode_min_data_hold_time_ns,
              i2c_fast_mode_plus_min_data_hold_time_ns,
          };

          // DBGPRINT("%s baud = %u\n", __func__, baudrate);
          if (baudrate <= i2c_standard_mode_freq)
          {
            i2c_speed = i2c_standard_mode;
          }
          else if (baudrate <= i2c_fast_mode_freq)
          {
            i2c_speed = i2c_fast_mode;
          }
          else
          {
            i2c_speed = i2c_fast_mode_plus;
          }
          auto val = prescale_map.find(baudrate);
          if (val != prescale_map.end())
          {
            hcnt = val->second[0];
            lcnt = val->second[1];
            sda_tx_setup_count = val->second[2];
            sda_tx_hold_count = val->second[3];
          }
          else
          {
            if (baudrate == 0)
            {
              DBGPRINT("%s return\n", __func__);
              return false;
            }
#ifdef UNITTEST
            uint32_t freq_in = sys_clock_hz;
#else
            uint32_t freq_in = clock_get_hz(clk_sys);
#endif
            uint32_t period = (freq_in + baudrate / 2) / baudrate;
            lcnt = (period * i2c_scl_factor_table[i2c_speed]) / i2c_period_table[i2c_speed];
            hcnt = period - lcnt;
            if (hcnt > I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_BITS)
            {
              DBGPRINT("%s return hcnt = %u\n", __func__, hcnt);
              return false;
            }
            if (lcnt > I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_BITS)
            {
              DBGPRINT("%s return lcnt = %u\n", __func__, lcnt);
              return false;
            }
            // IC_SS_SCL_HCNT and IC_FS_SCL_HCNT register values must be larger than IC_FS_SPKLEN + 5.
            if (hcnt <= 6)
            {
              DBGPRINT("%s return hcnt = %u\n", __func__, hcnt);
              return false;
            }
            // IC_SS_SCL_LCNT and IC_FS_SCL_LCNT register values must be larger than IC_FS_SPKLEN + 7.
            if (lcnt <= 8)
            {
              DBGPRINT("%s return\n", __func__);
              return false;
            }

            sda_tx_setup_count = nstoclk(i2c_data_setup_time_table[i2c_speed], freq_in);
            sda_tx_hold_count = nstoclk(i2c_data_hold_time_table[i2c_speed], freq_in);

            if (sda_tx_hold_count >= lcnt - 2)
            {
              DBGPRINT("%s return %d %d\n", __func__, sda_tx_hold_count, lcnt);
              return false;
            }
            prescale_map.emplace(baudrate, decltype(prescale_map)::mapped_type{hcnt, lcnt, sda_tx_setup_count, sda_tx_hold_count});
          }
#ifndef UNITTEST
          lgfx_i2c_disable(i2c_regs);

